---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeParamStartHookTanLen
source: html/1b10e0d0-d2e9-d157-db30-a29a809a5021.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeParamStartHookTanLen Property

"Start Tangent Hook Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeParamStartHookTanLen { get; }
```